Xjianjian/ZR60/ZR60_v1.0_freeRTOS/Lwip/App/STM8_FM17550_iap.c
/**
  ******************************************************************************
  * @file    STM8_FM17550_iap.c
  * @author  MCD Application Team
  * @version V1.1.0
  * @date    31-July-2013 
  * @brief   tcp echoclient application using LwIP RAW API
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT 2013 STMicroelectronics</center></h2>
  *
  * Licensed under MCD-ST Liberty SW License Agreement V2, (the "License");
  * You may not use this file except in compliance with the License.
  * You may obtain a copy of the License at:
  *
  *        http://www.st.com/software_license_agreement_liberty_v2
  *
  * Unless required by applicable law or agreed to in writing, software 
  * distributed under the License is distributed on an "AS IS" BASIS, 
  * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
  * See the License for the specific language governing permissions and
  * limitations under the License.
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "STM8_FM17550_iap.h"

#if LWIP_TCP
/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/

static struct ip_addr LocalIPaddr;
static struct ip_addr DestIPaddr;
//static char   Recev_buf[1460];
//static stm8_fm17550_TxTempBufStruct   TxBuf;
static stm8_fm17550_IapFlagStruct      IapFlag;
static char   Se_u_Txbuf[STM8_FM17550_TXBUF] = {0};

struct tcp_pcb *stm8_fm17550_pcb = NULL;

static u8_t   Sehttp_client_u_cnntSt = STM8_FM17550_IDLE;//tcp连接状态:0--空闲
static u8_t   Se_u_BusyFlg = 0U;//忙标志：0--空闲，1--忙
static u16_t  Se_w_TxTimer = 0U;//
static u16_t  Se_w_DownloadTimer = 0U;//
static u16_t  Se_w_ConntTimer = 0U;//建立连接计时器
static u8_t   Se_u_TimeoutCnt = 0U;//下载连接超时计数
static u32_t  Se_dw_byteCnt = 0U;//下载字节数计数

/* ECHO protocol states */
enum stm8_fm17550_states
{
  ES_NOT_CONNECTED = 0,
  ES_CONNECTED,
  ES_RECEIVED,
  ES_CLOSING,
};

/* structure to be passed as argument to the tcp callbacks */
struct stm8_fm17550
{
  enum stm8_fm17550_states state; /* connection status */
  struct tcp_pcb *pcb;          /* pointer on the current tcp_pcb */
  struct pbuf *p_tx;            /* pointer on pbuf to be transmitted */
};

struct stm8_fm17550 * stm8_fm17550_es = NULL;

static stm8_fm17550_UpdataInfoStruct UpdataInfo;

static uint8 Se_u_EnterBL[7U] = {0x20,0x00,0x30,0x01,0x00,0xCE,0x03};

static uint8 Se_u_FirmwareRefreshSt = 0U;//固件刷新状态：0--空闲；1--刷新中；2--刷新完成
static stm8_fm17550_Frame_Tx Frame_Tx;
/* Private function prototypes -----------------------------------------------*/
static err_t http_client_recv(void *arg, struct tcp_pcb *tpcb, struct pbuf *p, err_t err);
static void http_client_connection_close(struct tcp_pcb *tpcb, struct stm8_fm17550 * es);
static err_t http_client_poll(void *arg, struct tcp_pcb *tpcb);
static err_t http_client_connected(void *arg, struct tcp_pcb *tpcb, err_t err);
static void http_client_PostRequest(char* postAddr,char* Le_u_in,u16_t * Le_u_len,char* Le_u_out,u8_t Le_u_ConnectionValue);
static void http_client_MacRecombine(char* Le_u_mac);
static void http_ConnectErr(void *arg,err_t err);

static char stm8_fm17550_iap_connect(void);
static void stm8_fm17550_iap_disconnect(void);
static void stm8_fm17550_iap_sendMsg(char* data,u16_t len);

static void http_EraseFlash(uint32_t FLASH_Sector);
static void http_wrFlash(uint32_t FLASH_addr,uint8_t* Le_u_Dt,uint16_t Le_w_lng);
static void http_rdFlash(uint32_t FLASH_addr,uint8_t* Le_u_Dt,uint16_t Le_w_lng);
static uint8 Gethttpclient_dw_XOR(uint8* Le_u_Dt,uint16 Le_w_Lng);
/* Private functions ---------------------------------------------------------*/


/******************************************************
*函数名：stm8_fm17550_iap_parameter

*形  参：

*返回值：

*描  述：初始化

*备  注：
******************************************************/
void stm8_fm17550_iap_parameter(void)
{
	uint8 Le_u_i;
	IapFlag.TskFlag = 0U;//任务标志
	IapFlag.downloadFlag = STM8_FM17550_DOWNLOAD_IDLE;//
	Frame_Tx.Frame.Header = 0x20;//帧头
	Frame_Tx.Frame.Seqnr = 0x00;//数据帧包序号
	Frame_Tx.Frame.Cmd = 0x00;//数据长度,0－数据，1－终止
	Frame_Tx.Frame.Lng = 64U;//数据长度
	for(Le_u_i = 0U;Le_u_i < 64U;Le_u_i++)
	{
		Frame_Tx.Frame.Data[Le_u_i] = 0x00;//数据
	}
	Frame_Tx.Frame.CC = 0U;//校验和
	Frame_Tx.Frame.ETX = 0x03;//结束字符
	//http_EraseFlash(FLASH_Sector_3);
}

/******************************************************
*函数名：stm8_fm17550_iap_MainFunction

*形  参：

*返回值：

*描  述：消息记录主任务,5ms周期调用

*备  注：
******************************************************/
void stm8_fm17550_iap_MainFunction(void)
{
	uint8 Le_u_i;
	uint16 Le_w_lng;
	uint32 Le_dw_CheckSum;
	if(0 == GET_PHY_LINK_STATUS())/* Get Ethernet link status*/
	{
		IapFlag.TskFlag = 0U;//任务标志
		IapFlag.downloadFlag = STM8_FM17550_DOWNLOAD_IDLE;//
		Se_u_BusyFlg = 0U;
		Se_w_ConntTimer = 0U;
		Se_w_DownloadTimer = 0U;
		stm8_fm17550_iap_disconnect();
		Sehttp_client_u_cnntSt = STM8_FM17550_IDLE;
		return;
	}
	
	if(1U == GetZR60Ctrl_u_CardReaderIapSt())//升级固件标志有效
	{
		ClrZR60Ctrl_CardReaderIapSt();
		IapFlag.TskFlag = 1U;
		IapFlag.downloadFlag = STM8_FM17550_DOWNLOAD_IDLE;
		http_EraseFlash(FLASH_Sector_3);//擦除固件存储区
		//UpdataInfo.IapFlag = 1U;
		//http_wrFlash(HTTP_CLIENT_UPLOAD_INFO_SEC,(uint8_t*)(&UpdataInfo.Xor),sizeof(UpdataInfo));
	}
	
	/**********建立连接**********/
	if((DHCP_ADDRESS_ASSIGNED == STM8_FM17550_DHCP_STATE) && \
			(STM8_FM17550_IDLE == Sehttp_client_u_cnntSt))
	{	
		if(IapFlag.TskFlag == 1U)
		{
			if(1U != GetdnsAnalysis_u_ipValidity(http_download))
			{
				return;
			}
			GetdnsAnalysis_ipAddr(http_download,&DestIPaddr);
			if(ERR_OK == stm8_fm17550_iap_connect())
			{
				USART_PRINTF_S("建立下载连接...");
				IapFlag.TskFlag = 0U;
				Se_u_BusyFlg = 1U;
				Se_w_ConntTimer = 0U;
				Sehttp_client_u_cnntSt = STM8_FM17550_WAIT;
			}
		}
	}
	if(STM8_FM17550_WAIT == Sehttp_client_u_cnntSt)
	{
		Se_w_ConntTimer++;
		if(Se_w_ConntTimer <= (600U/(STM8_IAP_SCHEDULING_CYCLE/5U)))
		{
			if((stm8_fm17550_es->state == ES_CONNECTED) &&(ESTABLISHED == stm8_fm17550_pcb->state))
			{//连接建立成功
				USART_PRINTF_S("下载连接建立成功!\n");
				Se_w_ConntTimer = 0U;
				Sehttp_client_u_cnntSt = STM8_FM17550_LOADPCKT;//
			}
		}
		else
		{//连接建立失败
			USART_PRINTF_S("建立下载连接超时");
			Se_u_TimeoutCnt++;
			if(Se_u_TimeoutCnt >= 3U)
			{
				Se_u_TimeoutCnt = 0U;
				SetdnsAnalysis_ipUpdate(http_download);//更新ip
			}
			Sehttp_client_u_cnntSt = STM8_FM17550_DISCNNT;
		}	
	}
	
	/**********下载数据**********/
	if(STM8_FM17550_LOADPCKT == Sehttp_client_u_cnntSt)
	{
		if(IapFlag.downloadFlag == STM8_FM17550_DOWNLOAD_IDLE)
		{
			IapFlag.downloadFlag = STM8_FM17550_DOWNLOAD_UNDERWAY;
			USART_PRINTF_S("发送下载请求");
			memset(Se_u_Txbuf,0,sizeof(Se_u_Txbuf));//清0
			Le_w_lng = 0U;
			Se_dw_byteCnt = 0U;
			Se_w_DownloadTimer = 0U;//清下载超时计时器
			http_client_PostRequest("GET /CR_stm8_fm17550.bin HTTP/1.1\n",NULL,&Le_w_lng,Se_u_Txbuf,1U);
			stm8_fm17550_iap_sendMsg(Se_u_Txbuf,Le_w_lng);//数据发送	
		}
		
		Se_w_DownloadTimer++;
		if(Se_w_DownloadTimer >= STM8_FM17550_DOWNLOAD_TIMEOUT)//下载超时
		{
			USART_PRINTF_S("下载超时");	
			Se_w_DownloadTimer = 0U;
			Sehttp_client_u_cnntSt = STM8_FM17550_DISCNNT;//断开连接
		}
		else
		{
			if(IapFlag.downloadFlag == STM8_FM17550_DOWNLOAD_FINISH)//下载完成
			{
				Se_w_DownloadTimer = 0U;
				Sehttp_client_u_cnntSt = STM8_FM17550_DISCNNT;//断开连接
			}
		}
	}
	
	/**********断开连接**********/
	if(STM8_FM17550_DISCNNT == Sehttp_client_u_cnntSt)
	{
		stm8_fm17550_iap_disconnect();
		USART_PRINTF_S("断开连接...");
		Se_u_BusyFlg = 0U;
		Se_w_DownloadTimer = 0U;
		Sehttp_client_u_cnntSt = STM8_FM17550_IDLE;
	}
	
	/***********下载完成，刷新读卡器模块固件*********/
	if((IapFlag.downloadFlag == STM8_FM17550_DOWNLOAD_FINISH) && \
			stm8_fm17550_PerformCondition)
	{
		switch(Se_u_FirmwareRefreshSt)
		{
			case 0:
			{
				Le_dw_CheckSum = ((*((__IO uint8*)UpdataInfo.DtFirstAddr + UpdataInfo.Lng -4)) << 24) & 0xff000000;/*下载区数据校验和,下载的二进制文件的最后4字节为校验和*/
				Le_dw_CheckSum = Le_dw_CheckSum | ((*((__IO uint8*)UpdataInfo.DtFirstAddr + UpdataInfo.Lng -3)) << 16);/*下载区数据校验和*/
				Le_dw_CheckSum = Le_dw_CheckSum | ((*((__IO uint8*)UpdataInfo.DtFirstAddr + UpdataInfo.Lng -2)) << 8);/*下载区数据校验和*/
				Le_dw_CheckSum |= *((__IO uint8*)UpdataInfo.DtFirstAddr + UpdataInfo.Lng -1);/*下载区数据校验和*/
				//Le_dw_CheckSum = crc32(0xFFFFFFFF,(__IO uint8*)UpdataInfo.DtFirstAddr,(UpdataInfo.Lng -4));//根据下载区数据计算得到的校验和		
				if(Le_dw_CheckSum == crc32(0xFFFFFFFF,(__IO uint8*)UpdataInfo.DtFirstAddr,(UpdataInfo.Lng -4)))//crc32校验通过
				{
					USART_PRINTF_S("crc32校验通过，设置读卡器进入bootloader模式");
					SetUartCmn_TxMsg(Se_u_EnterBL,7);//设置读卡器进入bootloader模式
					Se_w_ConntTimer = 0U;
					IapFlag.EchoFlag = 0U;
					IapFlag.TxBusyFlag = 0U;
					IapFlag.SlaveRxSt = 0U;
					UpdataInfo.Cnt = 0U;
					UpdataInfo.CheckSum = 0U;
					Frame_Tx.Frame.Cmd = 0x00;
					UpdataInfo.Lng = UpdataInfo.Lng -4;//去掉4字节校验位后有效数据长度
					//SetUSART_BaudRate(UART3_USART,9600);//设置波特率9600
					Se_u_FirmwareRefreshSt = 1U;
				}
				else
				{
					USART_PRINTF_S("crc32校验未通过");
					IapFlag.downloadFlag = STM8_FM17550_DOWNLOAD_IDLE;
				}
			}
			break;
			case 1:
			{
				if(Se_w_ConntTimer >= (200U/(STM8_IAP_SCHEDULING_CYCLE/5U)))
				{
					//IapFlag.EchoFlag = 1U;
					if(IapFlag.TxBusyFlag == 0U)
					{//通信线空闲
						if(IapFlag.SlaveRxSt == 0U)
						{//从机正常接收数据
							if(Frame_Tx.Frame.Cmd == 0x32)
							{//表明在线刷新完成，退出在线刷新		
								USART_PRINTF_S("在线刷新完成，退出在线刷新");
								Se_u_FirmwareRefreshSt = 0U;
								//SetUSART_BaudRate(UART3_USART,115200);//设置波特率115200
								IapFlag.downloadFlag = STM8_FM17550_DOWNLOAD_IDLE;
								return;
							}
							
							memset(Frame_Tx.Frame.Data,0,64);//清0
							if(UpdataInfo.Cnt < UpdataInfo.Lng)
							{/* 拷贝升级文件数据发送给从机 */
								for(Le_u_i = 0U;Le_u_i < 64U;Le_u_i++)
								{
									Frame_Tx.Frame.Data[Le_u_i] = *(__IO uint8*)UpdataInfo.DtFirstAddr;
									UpdataInfo.CheckSum += Frame_Tx.Frame.Data[Le_u_i];
									UpdataInfo.DtFirstAddr++;
									UpdataInfo.Cnt++;
									if(UpdataInfo.Cnt == UpdataInfo.Lng)
									{
										break;
									}
								}
								Frame_Tx.Frame.Seqnr = 0xFF;
								Frame_Tx.Frame.Cmd = 0x31;
							}
							else
							{//发送校验和等信息
								USART_PRINTF_S("发送校验和等信息");
								Frame_Tx.Frame.Seqnr = 0xFF;
								Frame_Tx.Frame.Cmd = 0x32;
								Frame_Tx.Frame.Data[0] = (char)(UpdataInfo.Lng >> 24);//此处注意stm8s高字节在前
								Frame_Tx.Frame.Data[1] = (char)(UpdataInfo.Lng >> 16);
								Frame_Tx.Frame.Data[2] = (char)(UpdataInfo.Lng >> 8);
								Frame_Tx.Frame.Data[3] = (char)UpdataInfo.Lng;
								Frame_Tx.Frame.Data[4] = (char)(UpdataInfo.CheckSum >> 24);
								Frame_Tx.Frame.Data[5] = (char)(UpdataInfo.CheckSum >> 16);
								Frame_Tx.Frame.Data[6] = (char)(UpdataInfo.CheckSum >> 8);
								Frame_Tx.Frame.Data[7] = (char)UpdataInfo.CheckSum;
							}
							Frame_Tx.Frame.CC = Gethttpclient_dw_XOR(&Frame_Tx.Frame.Seqnr,67);
							SetUartCmn_TxMsg(Frame_Tx.FrmTx,70U);//发送升级文件数据
							Se_w_TxTimer = 0U;
							IapFlag.TxBusyFlag = 1U;
						}
						else
						{//数据传输过程中出现误码，重新发送升级文件
							USART_PRINTF_S("数据传输过程中出现误码，重新发送升级文件");
							Se_w_ConntTimer = 0U;
							IapFlag.EchoFlag = 0U;
							IapFlag.TxBusyFlag = 0U;
							IapFlag.SlaveRxSt = 0U;
							UpdataInfo.Cnt = 0U;
							UpdataInfo.CheckSum = 0U;
							Frame_Tx.Frame.Cmd = 0x00;
							UpdataInfo.DtFirstAddr = STM8_FM17550_CODE_SEC;/*数据段首地址*/
						}
					}
					else
					{
						Se_w_TxTimer++;
						if(Se_w_TxTimer >= (400U/(STM8_IAP_SCHEDULING_CYCLE/5U)))
						{//发送超时，退出在线刷新
							USART_PRINTF_S("发送超时，退出在线刷新");
							Se_u_FirmwareRefreshSt = 0U;
							IapFlag.downloadFlag = STM8_FM17550_DOWNLOAD_IDLE;
						}
					}				
				}
				else
				{
					Se_w_ConntTimer++;
				}
			}
			break;
			default:
			break;
		}
	}
}

