Xjianjian/ZR60/ZR60_v1.0_freeRTOS/Lwip/App/STM8_FM17550_iap.c
/* 在线升级状态 */
uint8_t GetStm8_fm17550_iapIdle(void)
{
	return ((Se_u_BusyFlg == 0) && (IapFlag.downloadFlag == STM8_FM17550_DOWNLOAD_IDLE));
}

/**
* @brief  Connects to the TCP echo server
* @param  None
* @retval None
*/
static char stm8_fm17550_iap_connect(void)
{
	s8_t ret;
	/* create new tcp pcb */
	stm8_fm17550_pcb = tcp_new();
	if (stm8_fm17550_pcb != NULL)
	{
		LocalIPaddr.addr = IPaddress;
		ret = tcp_bind(stm8_fm17550_pcb, &LocalIPaddr, 0); 
		USART_PRINTF_D("tcp_bind ret is: %d\n",ret);
		/* connect to destination address/port */
		ret = tcp_connect(stm8_fm17550_pcb,&DestIPaddr,STM8_FM17550_NNT_REMOTEPORT,http_client_connected);
		USART_PRINTF_D("tcp_connect ret is: %d\n",ret);

		if(ERR_OK != ret)
		{
			memp_free(MEMP_TCP_PCB, stm8_fm17550_pcb);
			stm8_fm17550_pcb = NULL;
		}
		else
		{
			tcp_err(stm8_fm17550_pcb,http_ConnectErr); 
		}
	}
	else
	{
		ret = ERR_MEM;
		/* deallocate the pcb */
		USART_PRINTF_S("下载连接tcp控制块分配失败");
	}
	return ret;
}

/*
	错误回调函数
*/
static void http_ConnectErr(void *arg,err_t err)
{  
	USART_PRINTF_S("下载连接err处理");
    switch(err)  
    {   
        case ERR_MEM:                                            /* Out of memory error.     */  
            USART_PRINTF_S("\r\n ERR_MEM   \r\n");  
        break;    
        case ERR_BUF:                                            /* Buffer error.            */  
            USART_PRINTF_S("\r\n ERR_BUF   \r\n");  
        break;  
        case  ERR_TIMEOUT:                                       /* Timeout.                 */  
            USART_PRINTF_S("\r\n ERR_TIMEOUT   \r\n");  
        break;  
        case ERR_RTE:                                            /* Routing problem.         */        
			USART_PRINTF_S("\r\n ERR_RTE   \r\n");  
        break;  
		case ERR_ISCONN:                                          /* Already connected.       */  
			USART_PRINTF_S("\r\n ERR_ISCONN   \r\n");  
        break;  
        case ERR_ABRT:                                           /* Connection aborted.      */  
            USART_PRINTF_S("\r\n ERR_ABRT   \r\n");  
			stm8_fm17550_pcb = NULL;
        break;  
        case ERR_RST:                                            /* Connection reset.        */       
            USART_PRINTF_S("\r\n ERR_RST   \r\n");  
			stm8_fm17550_pcb = NULL;
        break;  
        case ERR_CONN:                                           /* Not connected.           */  
			USART_PRINTF_S("\r\n ERR_CONN   \r\n");  
            break;  
        case ERR_CLSD:                                           /* Connection closed.       */  
            USART_PRINTF_S("\r\n ERR_CLSD   \r\n");  
			stm8_fm17550_pcb = NULL;
        break;  
        case ERR_VAL:                                            /* Illegal value.           */  
			USART_PRINTF_S("\r\n ERR_VAL   \r\n");  
			return;  
        case ERR_ARG:                                            /* Illegal argument.        */  
            USART_PRINTF_S("\r\n ERR_ARG   \r\n");  
			return;  
        case ERR_USE:                                            /* Address in use.          */  
			USART_PRINTF_S("\r\n ERR_USE   \r\n");  
			return;   
        case ERR_IF:                                             /* Low-level netif error    */  
            USART_PRINTF_S("\r\n ERR_IF   \r\n");  
        break;  
        case ERR_INPROGRESS:                                     /* Operation in progress    */  
            USART_PRINTF_S("\r\n ERR_INPROGRESS   \r\n");  
        break;  
		default:
		break;
    }  
}  


/* 从机响应状态 */
void Setstm8_fm17550_SlaveReplySt(u8_t Le_u_St)
{
	IapFlag.EchoFlag = 1U;
	IapFlag.TxBusyFlag = 0U;
	IapFlag.SlaveRxSt = Le_u_St;
	//Se_w_ConntTimer =(200U/(STM8_IAP_SCHEDULING_CYCLE/5U)) - 1U;//设置数据帧之间的间隔时间
}

/**
* @brief  Disconnects to the TCP echo server
* @param  None
* @retval None
*/
static void stm8_fm17550_iap_disconnect(void)
{
	/* close connection */
	http_client_connection_close(stm8_fm17550_pcb,stm8_fm17550_es);
}

/**
  * @brief Function called when TCP connection established
  * @param tpcb: pointer on the connection contol block
  * @param err: when connection correctly established err should be ERR_OK 
  * @retval err_t: returned error 
  */
static err_t http_client_connected(void *arg, struct tcp_pcb *tpcb, err_t err)
{
	if(err == ERR_OK)   
	{
		/* allocate structure es to maintain tcp connection informations */
		stm8_fm17550_es = (struct stm8_fm17550 *)mem_malloc(sizeof(struct stm8_fm17550));
		if(stm8_fm17550_es != NULL)
		{
			stm8_fm17550_es->state = ES_CONNECTED;
			stm8_fm17550_es->pcb = NULL;
			stm8_fm17550_es->p_tx = NULL;
			/* pass newly allocated es structure as argument to tpcb */
			tcp_arg(tpcb, stm8_fm17550_es);

			/* initialize LwIP tcp_recv callback function */ 
			tcp_recv(tpcb, http_client_recv);

			/* initialize LwIP tcp_sent callback function */
			//tcp_sent(tpcb, tcp_echoclient_sent);

			/* initialize LwIP tcp_poll callback function */
			tcp_poll(tpcb, http_client_poll, 1);

			return ERR_OK;
		}
		else
		{
			USART_PRINTF_S("下载连接structure es分配失败");
			/* close connection */
			http_client_connection_close(tpcb, stm8_fm17550_es);
			/* return memory allocation error */
			return ERR_MEM;  
		}
	}
	else
	{
		USART_PRINTF_D("下载连接连接回调函数 err: %d\n",err);
		/* close connection */
		http_client_connection_close(tpcb, stm8_fm17550_es);
	}
	return err;
}
    
/**
  * @brief tcp_receiv callback
  * @param arg: argument to be passed to receive callback 
  * @param tpcb: tcp connection control block 
  * @param err: receive error code 
  * @retval err_t: retuned error  
  */
static err_t http_client_recv(void *arg, struct tcp_pcb *tpcb, struct pbuf *p, err_t err)
{ 
	struct stm8_fm17550 *es;
	err_t ret_err;
	u16_t Le_w_i;
	char *position;
	char *endposition;
	u16_t Le_w_temp;
	u8_t Le_u_CnntLngVal[7U] = {0};
	LWIP_ASSERT("arg != NULL",arg != NULL);

	es = (struct stm8_fm17550 *)arg;

	/* if we receive an empty tcp frame from server => close connection */
	if (p == NULL)
	{
		USART_PRINTF_S("下载连接接收函数：p==NULL");
		ret_err = ERR_OK;
	}   
	/* else : a non empty frame was received from echo server but for some reason err != ERR_OK */
	else if(err != ERR_OK)
	{
		USART_PRINTF_S("下载连接接收函数：err!=ERR_OK");
		/* Acknowledge data reception */
		tcp_recved(tpcb, p->tot_len);
		/* free received pbuf*/
		pbuf_free(p);

		ret_err = err;
	}
	else if(es->state == ES_CONNECTED)
	{
		/* Acknowledge data reception */
		tcp_recved(tpcb, p->tot_len);// 必须调用，否则会引起发送窗口为0导致数据不能发送 
		if(STM8_FM17550_NNT_REMOTEPORT == tpcb->remote_port)
		{//从http报文中解析出数据体
			if(p->tot_len < 1460U)
			{
				if(NULL != strstr((char*)p->payload,"HTTP/1.1"))
				{//第一帧数据
					if(NULL != strstr((char*)p->payload,"HTTP/1.1 200 OK"))
					{//无报错时解析出Content-Length，Content-Length字段的值就是下载的数据总长度字节数
						position = strstr((char*)p->payload,"Content-Length: ") + 16U;//Content-Length字段数值的起始位置
						endposition = strchr(&(((char*)p->payload)[position - (char*)p->payload]), '\r\n');//首次出现'\r\n'的地址
						if((endposition - position) <= sizeof(Le_u_CnntLngVal))
						{
							for(Le_w_i = 0;Le_w_i < (endposition - position);Le_w_i++)
							{
								Le_u_CnntLngVal[Le_w_i] = ((char*)p->payload)[(position - (char*)p->payload) + Le_w_i];
							}
							Se_dw_byteCnt = 0U;
							UpdataInfo.Lng = atoi(Le_u_CnntLngVal);/*数据长度*/
							if(UpdataInfo.Lng > STM8_FM17550_DOWNLOAD_DATA_LNG)
							{//数据长度超出下载区大小
								USART_PRINTF_S("数据长度超出下载区存储空间容量");
								IapFlag.downloadFlag = STM8_FM17550_DOWNLOAD_IDLE;
								Sehttp_client_u_cnntSt = STM8_FM17550_DISCNNT;//断开连接	
							}
						}
						else
						{
							USART_PRINTF_S("数据长度有误");
							IapFlag.downloadFlag = STM8_FM17550_DOWNLOAD_IDLE;
							Sehttp_client_u_cnntSt = STM8_FM17550_DISCNNT;//断开连接
						}
				
