Xjianjian/ZR60/ZR60_v1.0_freeRTOS/Lwip/App/STM8_FM17550_iap.c
						USART_PRINTF_D("UpdataInfo.Lng = %d\n",UpdataInfo.Lng);
					}
					else
					{
						USART_PRINTF_S("http请求响应有错误");
						IapFlag.downloadFlag = STM8_FM17550_DOWNLOAD_IDLE;
						Sehttp_client_u_cnntSt = STM8_FM17550_DISCNNT;//断开连接	
					}
				}
				else
				{//用户app数据
					if(IapFlag.downloadFlag == STM8_FM17550_DOWNLOAD_UNDERWAY)
					{
						http_wrFlash((STM8_FM17550_CODE_SEC+Se_dw_byteCnt),(uint8_t*)p->payload,p->tot_len);
						Se_dw_byteCnt += p->tot_len;
						if(Se_dw_byteCnt >= UpdataInfo.Lng)
						{
							if(Se_dw_byteCnt == UpdataInfo.Lng)
							{//接收最后一帧数据，下载完成
								//UpdataInfo.Lng = UpdataInfo.Lng - 4;//有效数据长度 = 接收的数据总长 - 4字节校验
								UpdataInfo.DtFirstAddr = STM8_FM17550_CODE_SEC;/*数据段首地址*/
								//UpdataInfo.DtendAddr =  STM8_FM17550_CODE_SEC + Se_dw_byteCnt -1;/*数据段末地址*/
								//UpdataInfo.CheckSum = 0U;/*升级区数据校验和*/
								//UpdataInfo.IapFlag = 0U;/*在线升级标志*/
								//UpdataInfo.Xor = Gethttpclient_dw_XOR((uint8*)(&UpdataInfo.DtFirstAddr),(sizeof(UpdataInfo)-4));
								//http_wrFlash(HTTP_CLIENT_UPLOAD_INFO_SEC,(uint8_t*)(&UpdataInfo.Xor),sizeof(UpdataInfo));//升级信息写入flash
								IapFlag.downloadFlag = STM8_FM17550_DOWNLOAD_FINISH;
								USART_PRINTF_S("下载完成");
							}
							else
							{//传输字节数有误
								USART_PRINTF_S("接收的数据字节数有误");	
							}
						}
					}
				}
			}
			else
			{
				/*接收数据溢出*/
				USART_PRINTF_S("下载请求接收数据长度溢出");
			}
		}
		/* free received pbuf*/
		pbuf_free(p);
		ret_err = ERR_OK;
	}
	/* data received when connection already closed */
	else
	{
		USART_PRINTF_S("下载连接接收到未知数据");
		/* Acknowledge data reception */
		tcp_recved(tpcb, p->tot_len);
		/* free pbuf and do nothing */
		pbuf_free(p);
		ret_err = ERR_OK;
	}
	return ret_err;
}


/**
  * @brief  This function implements the tcp_poll callback function
  * @param  arg: pointer on argument passed to callback
  * @param  tpcb: tcp connection control block
  * @retval err_t: error code
  */
static err_t http_client_poll(void *arg, struct tcp_pcb *tpcb)
{
	err_t ret_err;
	struct echoclient *es;
	ret_err = ERR_OK;
	es = (struct echoclient*)arg;
	if (es == NULL)
	{
		USART_PRINTF_S("download connection tcp_poll 回调函数 ret_err = ERR_ABRT");
		//if(tpcb != NULL)
		{
			tcp_abort(tpcb);
		}
		ret_err = ERR_ABRT;
	}
	return ret_err;
}


/**
  * @brief This function is used to close the tcp connection with server
  * @param tpcb: tcp connection control block
  * @param es: pointer on echoclient structure
  * @retval None
  */
static void http_client_connection_close(struct tcp_pcb *tpcb, struct stm8_fm17550 * es )
{
	if (es != NULL)
	{
		mem_free(es);
		stm8_fm17550_es = NULL;
		USART_PRINTF_S("free stm8_fm17550_es\n");
	}
	
	if(tpcb != NULL)
	{
		/* remove callbacks */
		tcp_arg(tpcb,NULL);  
		tcp_recv(tpcb,NULL);
		tcp_err(tpcb,NULL);
		//tcp_sent(tpcb, NULL);
		tcp_poll(tpcb, NULL,0);
		/* close tcp connection */
		tcp_close(tpcb);
	}
	else
	{
		//USART_PRINTF_S("stm8_fm17550_pcb == NULL");
	}
}

/*
	发送报文
*/
static void stm8_fm17550_iap_sendMsg(char* data,u16_t len)
{
	tcp_write(stm8_fm17550_pcb,(char*)data ,len, 1);
	//tcp_output(stm8_fm17550_pcb);
}

/**
  * @brief http封装
  * @param 
  * @param
  * @retval None
  */
static void http_client_PostRequest(char* postAddr,char* Le_u_in,u16_t * Le_u_len,char* Le_u_out,u8_t Le_u_ConnectionValue)
{
	strcat(Le_u_out, postAddr);
	strcat(Le_u_out, "Accept: text/html,application/xhtml+xml,application/xml;q=0.9,image/webp,image/apng,*/*;q=0.8\r\n");
	//strcat(Le_u_out, "Accept-Encoding: gzip, deflate\r\n");
	//strcat(Le_u_out, "Accept-Language: zh-CN,zh;q=0.9\r\n");
	if(Le_u_ConnectionValue == 1U)
	{
		strcat(Le_u_out, "Connection: keep-alive\r\n");
	}
	else
	{
		strcat(Le_u_out, "Connection: close\r\n");
	}
	strcat(Le_u_out, "Host: mobile.zzwtec.com\r\n");
	strcat(Le_u_out, "\r\n\r\n");
	*Le_u_len = strlen(Le_u_out);
	USART_PRINTF_S(Le_u_out);
}


/*
//擦除flash扇区
*/
static void http_EraseFlash(uint32_t FLASH_Sector)
{
	__disable_irq() ; //关闭总中断
	//IWDG_Feed();//喂狗
	FLASH_Unlock();
	//下面这个清flash的状态标志很重要，如果没有清可能会导致擦除flash失败或者不能擦除
	FLASH_ClearFlag(FLASH_FLAG_EOP | FLASH_FLAG_OPERR | FLASH_FLAG_WRPERR | \
					FLASH_FLAG_PGAERR | FLASH_FLAG_PGPERR|FLASH_FLAG_PGSERR);
	(void)FLASH_EraseSector(FLASH_Sector,VoltageRange_3);
	FLASH_Lock();
	//IWDG_Feed();//喂狗
	__enable_irq() ; //打开总中断
}


/*
//写flash
*/
static void http_wrFlash(uint32_t FLASH_addr,uint8_t* Le_u_Dt,uint16_t Le_w_lng)
{
	uint16_t Le_w_i;
	//__disable_irq() ; //关闭总中断
	FLASH_Unlock();
	for(Le_w_i = 0;Le_w_i < Le_w_lng;Le_w_i++)
	{
		FLASH_ProgramByte((FLASH_addr+Le_w_i), Le_u_Dt[Le_w_i]);
	}
	FLASH_Lock();
	//__enable_irq() ; //打开总中断
}

/*
//读flash
*/
static void http_rdFlash(uint32_t FLASH_addr,uint8_t* Le_u_Dt,uint16_t Le_w_lng)
{
	uint16_t Le_w_i;
	__disable_irq() ; //关闭总中断
	for(Le_w_i=0; Le_w_i < Le_w_lng; Le_w_i++)
	{
		Le_u_Dt[Le_w_i] = *(__IO uint8*)FLASH_addr;//读FLASH中的数据，直接给出地址就行了。跟从内存中读数据一样
		FLASH_addr++;
	}
	__enable_irq() ; //打开总中断
}

/******************************************************
*函数名：

*形  参：

*返回值：

*描  述：异或取反校验

*备  注：
******************************************************/
static uint8 Gethttpclient_dw_XOR(uint8* Le_u_Dt,uint16 Le_w_Lng)
{
	uint16 Le_w_i;
	uint8 Le_u_Xor = 0U;
	for(Le_w_i = 0U; Le_w_i < Le_w_Lng;Le_w_i++)
	{
		Le_u_Xor ^= Le_u_Dt[Le_w_i];
	}
	return (~Le_u_Xor);
}

#endif /* LWIP_TCP */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
